In [1]:
import pandas as pd   ## 13 feb 25

In [2]:
df = pd.read_excel('/Users/indrani.sarkar/Downloads/default_of_credit_card_clients__courseware_version_1_21_19.xls')

In [3]:
# set the max columns to none
pd.set_option('display.max_columns', None)

df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,BILL_AMT1,BILL_AMT2,BILL_AMT3,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,798fc410-45c1,20000,2,2,1,24,2,2,-1,-1,-2,-2,3913,3102,689,0,0,0,0,689,0,0,0,0,1
1,8a8c8f3b-8eb4,120000,2,2,2,26,-1,2,0,0,0,2,2682,1725,2682,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,85698822-43f5,90000,2,2,2,34,0,0,0,0,0,0,29239,14027,13559,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,0737c11b-be42,50000,2,2,1,37,0,0,0,0,0,0,46990,48233,49291,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,3b7f77cc-dbc0,50000,1,2,1,57,-1,0,-1,0,0,0,8617,5670,35835,20940,19146,19131,2000,36681,10000,9000,689,679,0

In [4]:
df[['ID' ,'BILL_AMT1', 'PAY_AMT1', 'PAY_1']]

                  ID  BILL_AMT1  PAY_AMT1 PAY_1
0      798fc410-45c1       3913         0     2
1      8a8c8f3b-8eb4       2682         0    -1
2      85698822-43f5      29239      1518     0
3      0737c11b-be42      46990      2000     0
4      3b7f77cc-dbc0       8617      2000    -1
...              ...        ...       ...   ...
29995  ecff42d0-bdc6     188948      8500     0
29996  99d1fa0e-222b       1683      1837    -1
29997  95cdd3e7-4f24       3565         0     4
29998  00d03f02-04cd      -1645     85900     1
29999  15d69f9f-5ad3      47929      2078     0

[30000 rows x 4 columns]

Why df[['ID', 'BILL_AMT1', 'PAY_AMT1', 'PAY_1']] instead of df['ID', 'BILL_AMT1', 'PAY_AMT1', 'PAY_1']?
Double brackets ([[]]) return a DataFrame

df[['ID', 'BILL_AMT1', 'PAY_AMT1', 'PAY_1']] â†’ Returns a DataFrame with only these columns.
This is useful when you want to keep the DataFrame structure for further operations (e.g., applying .describe(), .groupby(), etc.).
Single brackets ([]) return a Series (only for one column)

df['ID'] â†’ Returns a Series, not a DataFrame.
If you try df['ID', 'BILL_AMT1'], it will throw an error because Pandas expects a single column name inside single brackets.

In [7]:
df.describe()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,BILL_AMT1,BILL_AMT2,BILL_AMT3,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
count,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,3.000000e+04,30000.000000,30000.000000,30000.000000,30000.000000,3.000000e+04,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000
mean,165760.989333,1.586500,1.833333,1.535900,35.108800,-0.132867,-0.164333,-0.219300,-0.263900,-0.288033,50646.744233,48624.349167,4.649736e+04,42791.362167,39884.398167,38480.350933,5613.321500,5.855410e+03,5174.387967,4776.089733,4754.749200,5164.223267,0.218733
std,130158.590432,0.513348,0.807699,0.542698,9.851592,1.191215,1.191096,1.162348,1.127519,1.144981,73376.695080,70893.963498,6.910251e+04,64090.316188,60606.644833,59406.836932,16539.094312,2.299256e+04,17565.538305,15532.893047,15239.070708,17712.664703,0.413394
min,0.000000,0.000000,0.000000,0.000000,0.000000,-2.000000,-2.000000,-2.000000,-2.000000,-2.000000,-165580.000000,-69777.000000,-1.572640e+05,-170000.000000,-81334.000000,-339603.000000,0.000000,0.000000e+00,0.000000,0.000000,0.000000,0.000000,0.000000
25%,50000.000000,1.000000,1.000000,1.000000,28.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,3234.000000,2682.000000,2.403000e+03,2034.000000,1534.000000,1080.000000,836.000000,7.217500e+02,371.000000,223.000000,170.750000,9.000000,0.000000
50%,140000.000000,2.000000,2.000000,2.000000,34.000000,0.000000,0.000000,0.000000,0.000000,0.000000,21644.500000,20597.000000,1.975250e+04,18759.500000,17835.500000,16643.000000,2084.500000,2.000000e+03,1776.000000,1500.000000,1500.000000,1500.000000,0.000000
75%,240000.000000,2.000000,2.000000,2.000000,41.000000,0.000000,0.000000,0.000000,0.000000,0.000000,66148.500000,62999.750000,5.952675e+04,53572.250000,49804.000000,48863.500000,5000.000000,5.000000e+03,4500.000000,4000.000000,4000.000000,4000.000000,0.000000
max,1000000.000000,2.000000,6.000000,3.000000,79.000000,8.000000,8.000000,8.000000,8.000000,8.000000,964511.000000,983931.000000,1.664089e+06,891586.000000,927171.000000,961664.000000,873552.000000,1.684259e+06,896040.000000,621000.000000,426529.000000,528666.000000,1.000000

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  object
 1   LIMIT_BAL                   30000 non-null  int64
 2   SEX                         30000 non-null  int64
 3   EDUCATION                   30000 non-null  int64
 4   MARRIAGE                    30000 non-null  int64
 5   AGE                         30000 non-null  int64
 6   PAY_1                       30000 non-null  object
 7   PAY_2                       30000 non-null  int64
 8   PAY_3                       30000 non-null  int64
 9   PAY_4                       30000 non-null  int64
 10  PAY_5                       30000 non-null  int64
 11  PAY_6                       30000 non-null  int64
 12  BILL_AMT1                   30000 non-null  int64
 13  BILL_AMT2                   30000 non-null  int64
 14  BILL_AMT3                   30000 non-null  int64
 15  BILL_AMT4                   30000 non-null  int64
 16  BILL_AMT5                   30000 non-null  int64
 17  BILL_AMT6                   30000 non-null  int64
 18  PAY_AMT1                    30000 non-null  int64
 19  PAY_AMT2                    30000 non-null  int64
 20  PAY_AMT3                    30000 non-null  int64
 21  PAY_AMT4                    30000 non-null  int64
 22  PAY_AMT5                    30000 non-null  int64
 23  PAY_AMT6                    30000 non-null  int64
 24  default payment next month  30000 non-null  int64
dtypes: int64(23), object(2)
memory usage: 5.7+ MB

In [9]:
df.shape

(30000, 25)

#### 17th Feb

In [10]:
df.columns

Index(['ID', 'LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE', 'PAY_1',
       'PAY_2', 'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2',
       'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1',
       'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6',
       'default payment next month'],
      dtype='object')

#### Select the column (ID) and count unique values using the following command:

In [11]:
df['ID'].nunique()

29687

In [12]:
df.shape

(30000, 25)

We see here that the number of unique IDs is less than the number of rows. This implies that the ID is not a unique identifier for the rows of the data. So we know that there is some duplication of IDs. But how much? Is one ID duplicated many times? How many IDs are duplicated?

We can use the value_counts() method on the ID Series to start to answer these questions. This is similar to a group by/count procedure in SQL. It will list the unique IDs and how often they occur. We will perform this operation in the next step and store the value counts in the id_counts variable.

In [15]:
df['ID'].value_counts().sort_values(ascending=False)

ID
ad23fe5c-7b09    2
1d58344c-5793    2
b6ca3733-7459    2
183f18d5-0b44    2
56945919-0933    2
                ..
f302156c-d681    1
e27d8b21-1d4e    1
7a2eb045-ce1e    1
0582c71d-2a65    1
15d69f9f-5ad3    1
Name: count, Length: 29687, dtype: int64

In [17]:
id_counts = df['ID'].value_counts()
id_counts.head()

ID
ad23fe5c-7b09    2
1fb3e3e6-a68d    2
89f8f447-fca8    2
7c9b7473-cc2f    2
90330d02-82d9    2
Name: count, dtype: int64

In [18]:
id_counts.value_counts()

count
1    29374
2      313
Name: count, dtype: int64

In [19]:
dupe_mask = id_counts == 2 ## always gives boolean value
# dupe_mask[0:100]
dupe_mask

ID
ad23fe5c-7b09     True
1fb3e3e6-a68d     True
89f8f447-fca8     True
7c9b7473-cc2f     True
90330d02-82d9     True
                 ...
2edeb3a6-d38d    False
27e11893-92e9    False
2b1c282b-441e    False
bd737997-0eb0    False
15d69f9f-5ad3    False
Name: count, Length: 29687, dtype: bool

In [36]:
dupe_mask.unique()

array([ True, False])

#### 18th Feb

In [20]:
id_counts.index[0:5]

Index(['ad23fe5c-7b09', '1fb3e3e6-a68d', '89f8f447-fca8', '7c9b7473-cc2f',
       '90330d02-82d9'],
      dtype='object', name='ID')

In [21]:
type(id_counts)

pandas.core.series.Series

In [22]:
dupe_ids = id_counts.index[dupe_mask] ### important

1. id_counts.index returns the list of unique IDs: Index(['ID_123', 'ID_456', 'ID_789', 'ID_101'], dtype='object')

2. id_counts.index[dupe_mask] applies the boolean mask, selecting only the IDs that occur more than once

In [38]:
len(dupe_mask)

29687

In [39]:
dupe_ids = list(dupe_ids)
len(dupe_ids)

313

### **Summary of the Approach to Analyzing Duplicate IDs**  

1. **Identify Duplicate IDs**  
   - Use `value_counts()` to count occurrences of each ID.  
   - Create a Boolean mask (`dupe_mask`) to filter IDs appearing more than once.  
   - Extract duplicate IDs using `id_counts.index[dupe_mask]`.  

2. **Select the First Three Duplicate IDs**  
   - `dupe_ids = id_counts.index[dupe_mask]` stores the duplicate IDs.  
   - `dupe_ids[0:3]` extracts the first three from this list.  

3. **Filter the DataFrame for These IDs**  
   - Use `isin(dupe_ids[0:3])` to create a Boolean mask where `True` marks rows with these IDs.  
   - Use `df.loc[...]` to extract rows that match these IDs.  
   - The `:` in `df.loc[...]` ensures all columns are included in the output.  

ðŸ“Œ **Key Takeaway:**  
This method efficiently filters the DataFrame to **compare all feature values** for the first three duplicate IDs, helping to detect any differences in their attributes. ðŸš€

In [24]:
dupe_ids[0:5]

['ad23fe5c-7b09',
 '1fb3e3e6-a68d',
 '89f8f447-fca8',
 '7c9b7473-cc2f',
 '90330d02-82d9']

In [25]:
df.loc[df['ID'].isin(dupe_ids[0:3]),:] ## important

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,BILL_AMT1,BILL_AMT2,BILL_AMT3,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
5033,89f8f447-fca8,320000,2,2,1,32,0,0,0,0,0,0,160832,164750,168370,169371,172868,150827,8000,8000,5500,6100,6000,5000,0
5133,89f8f447-fca8,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
16727,1fb3e3e6-a68d,80000,1,2,2,33,2,2,0,0,0,0,24928,24229,25832,27394,29922,31879,0,2000,2000,3000,2600,0,1
16827,1fb3e3e6-a68d,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
29685,ad23fe5c-7b09,50000,1,3,1,32,0,0,0,0,0,-1,47974,43680,22133,12882,8131,3983,3000,2871,1000,163,3983,3771,1
29785,ad23fe5c-7b09,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0

We can see some duplicates here, and it looks like every duplicate ID has one row with data, and another row with all zeros. Is this the case for every duplicate ID? Let's check.

In [26]:
df.shape

(30000, 25)

In [27]:
df_zero_mask = df == 0

In [41]:
# df_zero_mask

The .iloc[] method in Pandas is used for integer-based indexing (row and column selection).

: â†’ Selects all rows

1: â†’ Selects all columns starting from index 1 (second column) onward

In [28]:
feature_zero_mask = df_zero_mask.iloc[:,1:].all(axis=1)

In [49]:
sum(feature_zero_mask)

315

It looks like there are at least as many "zero rows" as there are duplicate IDs. Let's remove all the rows with all zero features and response, and see if that gets rid of the duplicate IDs.

In [50]:
df_clean_1 = df.loc[~feature_zero_mask,:].copy()

Breaking it Down:

feature_zero_mask â†’ A boolean mask (a Series of True/False values) that determines which rows to keep or remove.

~feature_zero_mask â†’ The tilde (~) is a bitwise NOT operator, which inverts the boolean values (True â†’ False and False â†’ True).

df.loc[...] â†’ Selects only rows where feature_zero_mask is False (since we inverted it).

:, â†’ Includes all columns.

.copy() â†’ Creates a copy of the filtered DataFrame to avoid modifying the original DataFrame.

In [51]:
df_clean_1.shape

(29685, 25)

In [52]:
df_clean_1['ID'].nunique()

29685

In [53]:
df_clean_1.to_csv('df_clean_1.csv', index=False)